{
  "emotional_archetype": "Thank you for completing all the questions. Let's discover your emotional archetype.\n\n**ARCHETYPE_CODE: Caregiver Owl**\n\n**Synthesis:**\nAs a Caregiver Owl, you showcase qualities of compassion and a deep understanding of others' needs. You value harmony in relationships and tend to prioritize the well-being of those around you. While you may find it challenging to express your own vulnerabilities, your strength lies in your nurturing nature and ability to provide support to those in your circle.\n\n**Top Emotional Patterns**\nYour top emotional patterns include:\n1. Valuing peace and harmony in relationships.\n2. Prioritizing the needs of others.\n3. Seeking to feel safe and supported.\n\n**Core Type**\nYour core type is characterized by empathy, caregiving, and a keen sense of responsibility towards others.\n\n**How It Shows Up Now**\nCurrently, you may find yourself often putting others' needs above your own and striving to maintain peace and harmony in your relationships.\n\n**Under Stress**\nDuring times of stress, you may struggle with expressing your own needs and may feel overwhelmed by the emotional demands of others.\n\n**Growth Direction**\nEmbracing vulnerability and prioritizing self-care can lead to personal growth and a deeper understanding of your own emotional needs.\n\n**Other Ways You Learned to Stay Safe**\nYou may have developed strategies to avoid conflict and prioritize the well-being of others to maintain a sense of security and stability in your relationships.\n\n**What This Means for You**\nRecognizing your capacity for empathy and caregiving is a strength that can bring comfort and support to those around you. Balancing this with self-care and setting boundaries can help you maintain emotional well-being.\n\nYou can now explore more about yourself in our Life, Relationships, Work, Patterns, or General chats. Feel free to choose where you'd like to delve deeper. \n\nWould you like to discuss any specific area further, or do you have any questions?"
}